about.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>О проекте</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="О проекте"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2012-01-29 18:51:36 MSK"/>
<meta name="author" content="Urist McLisper"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>
<link rel="stylesheet" type="text/css" href="css/worg.css" />

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">О проекте</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Что это за проект?</a></li>
<li><a href="#sec-2">2 Чего мы хотим?</a></li>
<li><a href="#sec-3">3 Кто мы?</a></li>
<li><a href="#sec-4">4 Название проекта</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Что это за проект?</h2>
<div class="outline-text-2" id="text-1">

<p>DF - выдающийся проект с безумным уровнем детализации игрового
мира. Нам это очень нравится. Мы прекрасно понимаем, что одному с
чистого листа поднимать такой проект - очень не просто, особенно, если
это хобби, а не основная работа (как у Тоади, например).
</p>

<p>
Этот проект - попытка собрать и упорядочить достаточно большой объем
информации по "предметной области" игрового мира, который нам всем так
нравится. Этот проект - попытка облегчить жизнь тому самому одинокому
разработчику, который мечтает о своем DF.
</p>
</div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Чего мы хотим?</h2>
<div class="outline-text-2" id="text-2">

<blockquote>

<p>Напишу сумбурно что я думаю по всему этому поводу. Мысли запиливать 
свой ДФ, я уверен возникали у многих и всплески подобных настроений 
бывают обычно после каких-то успехов (даже не совсем крупных) 
одиночек, который пилят что-то своё и показывают, и обсуждают на борде 
(слания, например), но в процесс разработки никого допускать не 
собираются (причины опустим). Так к чему я это все клоню? А к тому, 
что тут есть (мало, но есть; как известно - люди подключаются 
активней, когда есть какие-то результаты) люди, который хотят запилить 
что-то в духе ДФ, но не могут по ряду причин. Что я предлагаю? Итак, 
господа хорошие, если мы не можем написать программу, то может 
попробуем хотя бы спроектировать ее? В общем и целом пласт технологий, 
алгоритмов, фич, правил и условий будет един - эту часть мы вполне 
можем делать коллективно и децентрализованно. Я предлагаю организовать 
подробную базу знаний/ТЗ где была бы собранна ценная информация для 
разработчика. И держать всю эту инфу на гитхабе, например - можно и не 
пушить свои изменения, добавления в чужие репы - кому надо тот и сам 
заберет (а забирать коммиты у всех права есть). Таким образом 
обеспечена децентрализованность и отсутствие проблем с правами доступа 
(свн - овнеры, контрибьютеры, коммитеры; плюс все хранится 
централизовано - велика вероятность все проебать; децентрализованные 
системы - надежнее, тут и спору нет). 
</p>
<p>
Что должно быть в этой базе знаний? Я на первый взгляд разбил бы эту 
инфу на следующие категории: 
</p><ul>
<li>общая информация, не привязанная к реализации 
<ul>
<li>общие ожидания от игры, вишлисты, фичреквесты - фантазировать
    здесь. Тут тусуются самые безрукие.
</li>
<li>описание предметных областей - что-то вроде инфы из магмавики. Тут
    ценится навык подробно описать и разжевать какие-то концепции (биомы, конвеер производства и другое). 
</li>
<li>алгоритмы - тщательно описанные и разжеванные (поиск путей, жидкости, генераторы шумов и прочее). 
</li>
</ul>

</li>
<li>информация привязанная к реализации 
<ul>
<li>структуры данных, форматы 
</li>
<li>реализации алгоритмов 
</li>
</ul>

</li>
<li>Другое - какие-то полезные статьи и инфа. 
</li>
</ul>



</blockquote>


</div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> Кто мы?</h2>
<div class="outline-text-2" id="text-3">

<p>Одинокие разработчики, которые в глубине души мечтают сделать свой DF.
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> Название проекта</h2>
<div class="outline-text-2" id="text-4">

<p>Я пока недалеко продвинулся в дварфийском, но по D&amp;D'шной версии
"undivver arau" переводится как "большой план/стратегия".
</p></div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2012-01-29 18:51:36 MSK</p>
<p class="author">Author: Urist McLisper</p>
<p class="creator">Org version 7.8.03 with Emacs version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
